{"pageProps":{"content":"\r\n![download](https://user-images.githubusercontent.com/62385965/212729603-469364de-33f5-4766-b5c5-f8bbb3947c70.jpg)\r\nNGRX is a popular library for managing the state of an Angular application. It is built on top of the RxJS library and uses the principles of reactive programming to make it easier to handle complex state management tasks.\r\n\r\nOne of the main advantages of NGRX over plain RxJS is that it provides a consistent and well-structured way to manage the state of an application. With NGRX, the state of the application is managed in a centralized store, which makes it easy to keep track of all the state changes and handle them in a predictable way.\r\n\r\nNGRX also provides a set of powerful tools for managing the state of an application, such as actions, reducers, and effects. Actions are used to describe the changes to the state, reducers are used to update the state based on the actions, and effects are used to handle side-effects, such as making an API call or navigating to a different page.\r\n\r\nAnother advantage of NGRX is that it is designed to work seamlessly with Angular. It uses Angular's change detection mechanism to automatically update the view when the state changes, and it also integrates with Angular's dependency injection system, which makes it easy to manage the state throughout the application.\r\n\r\nAdditionally, NGRX provides a set of powerful tools for debugging, testing, and performance optimization, such as the ability to log state changes, time-travel debugging, and memoized selectors.\r\n\r\nUsing plain RxJS:\r\n\r\n```\r\nimport { BehaviorSubject } from 'rxjs';\r\n\r\nconst counterSubject = new BehaviorSubject(0);\r\n\r\nfunction increment() {\r\n  const currentCount = counterSubject.getValue();\r\n  counterSubject.next(currentCount + 1);\r\n}\r\n\r\nfunction decrement() {\r\n  const currentCount = counterSubject.getValue();\r\n  counterSubject.next(currentCount - 1);\r\n}\r\n\r\ncounterSubject.subscribe(count => {\r\n  console.log(count);\r\n});\r\n```\r\nIn this example, a BehaviorSubject is used to manage the state of the counter. The BehaviorSubject is initialized with an initial value of 0. The increment and decrement functions are used to update the state by calling the next method on the BehaviorSubject and passing the new count.\r\n\r\nThe subscribe method is used to subscribe to the counterSubject and log the current count to the console whenever it changes.\r\n\r\nUsing NGRX:\r\n\r\n```\r\nimport { StoreModule, Store } from '@ngrx/store';\r\nimport { counterReducer } from './counter.reducer';\r\n\r\n@NgModule({\r\n  imports: [\r\n    StoreModule.forRoot({ count: counterReducer })\r\n  ]\r\n})\r\nexport class AppModule { }\r\n\r\nexport const increment = createAction('[Counter] Increment');\r\nexport const decrement = createAction('[Counter] Decrement');\r\n\r\n@Injectable()\r\nexport class CounterService {\r\n  count$ = this.store.pipe(select('count'));\r\n\r\n  constructor(private store: Store) { }\r\n\r\n  increment() {\r\n    this.store.dispatch(increment());\r\n  }\r\n\r\n  decrement() {\r\n    this.store.dispatch(decrement());\r\n  }\r\n}\r\n\r\n```\r\nIn this example, NGRX is used to manage the state of the counter. The StoreModule is imported from the @ngrx/store library and configured with a root reducer that handles the counter state.\r\n\r\nActions are defined using the createAction method, increment and decrement actions are used to update the state. The store is injected into a service, which has a count$ property that selects the count from the store and makes it available for subscription.\r\n\r\nThe increment and decrement methods dispatch the corresponding actions to the store, which causes the state to update.\r\n\r\nWith this example, you can see that NGRX provides a more structured way to manage the state of an application. It enforces a clear separation of concerns between the state, the actions that update the state, and the reducers that handle the actions. It also provides a powerful set of tools for debugging, testing, and performance optimization, such as the ability to log state changes, time-travel debugging, and memoized selectors.\r\n\r\nAdditionally, NGRX provides a built-in mechanism for handling async actions with the help of the @Effect decorator, which makes it easy to handle and manage async code in your application.\r\n\r\nIn summary, NGRX provides a powerful and well-structured way to manage the state of an Angular application, and it provides a set of powerful tools for managing complex state management tasks. It is built on","slug":"5","title":"NGRX vs RXJS"},"__N_SSG":true}